{
  "podcast_details": {
    "podcast_title": "Unconfuse Me with Bill Gates",
    "episode_title": "Episode 2: Sal Khan",
    "episode_image": "https://f.prxu.org/4383/images/a281b725-e64f-4bec-80f0-97e498f4f589/Cover_UnconfuseMe_3000x3000.jpg",
    "episode_transcript": " I started getting a few goosebumps. And then I said, well, ask ChatGPT why that's the answer. It explained it. Oh, yeah. It's so good at that. I had great teachers that I've learned from. I had a librarian at my elementary school. I have a great tennis coach. And the best way to get unconfused about something is to find somebody who really deeply understands it. And I call that getting unconfused. Welcome to Unconfuse Me. I'm Bill Gates. The role of technology in education isn't always obvious, but the potential and the possibilities are inspiring. When I would talk to people about loving to learn on the internet, and it was just at the point where putting up videos was kind of getting mainstream, it had been about 2010. And people said, wow, you've got to use Khan Academy. My guest today is a teacher. He's CEO of Khan Academy, Sol Khan. Khan Academy is an amazing tool. I was so impressed that Sol was able to teach such a broad range of subjects himself in the early days. Khan Academy's got 140 million users. A lot of students have benefited. So I'm excited to have him here today. Welcome, Sol. Thanks for having me. Well, to start, I found out when you were younger, you were a singer in a heavy metal band and a cartoonist for the school paper. So which is the better skill, drawing or singing? It depends what you're trying to do, but I'll say drawing. Yeah, well, in your lectures, you do have to draw stuff. And it's nice. You erase a bunch of times if you don't like what you did. No, so every now and then, if you watch enough of videos, I try to flex my art a little bit. And you're like, oh, that, yeah, Sol can draw a cartoon. Sol can do a little bit of shading and cross-stitch and all of that. When I was a kid, I would just draw for hours. And now I realize that it does give you a certain, like, when you never get bored. And it does, I think, build a certain curiosity and creativity, just drawing all day. Well, Sol, remind us how you got into all of this. I think you were at a hedge fund at one point. Yeah, you go back to 2004. My original background was in tech. When I go to business school, I go into finance. I was an analyst at a hedge fund in Boston. And I had just gotten married, family visiting me from New Orleans, which is where I was born and raised. And it just came out a conversation where my 12-year-old cousin Nadia was having trouble with math. I said, hey, Nadia, when you go back to New Orleans, I'm happy to tutor you. She agreed. Started tutoring her after work every day. And long story short, that made a difference. It went from her being a weak math student or perceiving herself to be a weak math student to being a very strong one. Started tutoring her brothers. Words present my family-free tutoring is going on. Before I know it, I'm tutoring 10, 15 cousins. By 2009, there was a couple of almost 100,000 folks who were using it back then. That's when I took the plunge, set it up as a not-for-profit, mission free world-class education for anyone anywhere. And then it spread. Oh, yeah. A lot of the vision of Khan Academy in the early days, yes, there was an accessibility piece of it. Yeah, we can make videos. We can share with everyone. But the pedagogical aspect wasn't just access. It was that people could finally leverage technology to learn at their own pace. If you only got a 70% or 80% on some concept, the class doesn't need to move on to the next one and build on that gap. The students should be allowed to work on that. If you just let people have a strong foundation, the next few layers in math come pretty easy. With a weak foundation, no matter how bright or hardworking you are, they're very, very difficult. So that was the thesis, I think over the last 10 years on this journey. We've got a ton of efficacy studies in different contexts, different countries, and they all kind of say the same story, that if students engage, let's call it 30 to 60 minutes a week, even that, what I would call a fairly low level of engagement, they're growing pretty dramatically, 20, 30% more than expected, or in some cases more. Amazing. And so I think the question over the next couple of years is how do we get more students to engage at that level? Yeah, I think that challenge, a lot of our conversations have been on that your tools are a miracle for the 10 to 15% most motivated, but then how do we draw in that other 85%? And I do think in the last year or two as you've engaged with teachers and districts, we're starting to see that it can be a tool basically for all students. That's the goal. That's what I mean, yeah. But to your point, I actually think 80, 90% of hopefully 100% of students, if they're able to engage in the right way, especially if you catch them early, they can have that foundation. I think the main issue is just a lot of kids, frankly, just check out by the time they're in middle school. So in learning, you've got the classroom environment, can use that time in a certain way. And you've got whatever time you get with a student where they're kind of by themselves and assume they have a device. How do you see the time in the classroom? Is the availability of your tools shifting what people do in the classroom? And do they use it real time in the classroom? We were all starting 10 years ago, 12 years ago. It was only more fluent school districts that would have one-to-one laptops. The rest of them had to share. The good thing is over the last 10 years, because of E-rate, a lot of that's been addressed. It's unusual now to see a school where you don't have one-to-one laptops in say a math class. And so yeah, all the students will take out the laptops and do 20 minutes while the teacher walks around. They'll take 10 kids aside, do a focus intervention with them, do a worked example with them, the other 20 keep working. Then they'll take another 10 aside. But when they do that consistently, it makes a huge difference. And then for the students who either need gap filling, or the students who are ready to race ahead, they can do so. That's what they really like about Khan Academy. Not only do you get that practice and feedback in the moment, but the kids who wanna race ahead can, and the kids who need to do some gap filling can too. And the dashboard that helps the teacher see the status of all the students, that's a Khan Academy thing that the teacher account gives them a really clear indication of what's going on. I mean, we all remember growing up in a classroom that the only time of real measurement is at the end of the unit. And then you get the test, the test is graded, you get a 90%, I get an 80%. All right, let's move on. No one even attempts to improve that. And so what we realize is that now with tools like Khan Academy, you can give real time information, well, you could give real time feedback to the student, but you can also give real time information to the teacher so that they can intervene and they can do things. I hope in the future that that practice is the assessment, that you don't even have to take separate assessments. But yeah, the idea is let's give the teachers real time information. Let's not wait until it's too late. Let's talk about AI, you and I have both been lucky enough over the last six months or so to have engagement with the mix of both Microsoft and OpenAI and have early access. And I remember some of the best examples of how to get the AI to do fun things were when you came up and saw me and we were brainstorming about this, you were the one who said, hey, if you tell it to write a speech like various politicians, including Trump and others, that it's stunning how it captures the voice of different people. So, give us the how you first were using the AI and then, this is super timely because you've just recently come out with the Conmigo, if I'm saying that right. That's right, very good. Yeah, I mean, it was OpenAI folks reached out and they said, hey, we're a couple of weeks away from having the first training of our model. And they wanted to reach out to Khan Academy for two reasons. One was they said, we wanna make this really good at AP Biology. And I only found out later, I don't know if this is true. They told me you gave them the challenge. That's right, in June, they kept showing me this thing and I was like, yeah, it's kind of an idiot savant. I don't think it's practical. Why don't you see if it can do with the AP Biology exam and I'm not gonna pay any attention until you can like get a five. And I thought, okay, that'll give me three years to work on HIV and malaria. These guys. And then it was so bizarre because Sam Altman and Greg Brockman in Lake August said, hey, we wanna come show you this thing. And so it was early September when there were like 30 people at my house. And I'd said it's the most stunning demo I've ever seen in my life. I mean, right up there with seeing the Xerox PARC graphics user interface that set the agenda for Microsoft for about 15 years. You know, this demo was so surprising to me. The emergent depth that as they scaled up the training set, its fluency and you have to say understanding that computers could not read in the sense humans do and it couldn't write in the sense humans do. And now, you know, with lots of footnotes about hallucination and things like that. But I'm still personally in a state of shock at, wow, it is so good and okay, therefore, you know, let's see where we can put it to good use. Yeah, no, 100%. And so thank you for that challenge to them. I think that helped that they came to us because we have a large library of AP biology questions, et cetera, like, hey, can we use that to either evaluate or train? And at the time I was like, well, what's in it for Khan Academy? I'm in it and they're like, well, you know, maybe you get access to the model. I too was skeptical. I'd seen GPT-3 at that point. It was cool, but it wasn't, I don't see how we're gonna apply it. Two weeks later, they showed us the AP bio question. He said, so Sal, what's the answer to this? And I was like, okay, I think it's C. And it said, oh, the answer's C. And I was like, oh, that's interesting. I started getting a few goosebumps. And then I said, well, ask it why that's the answer. It explained it. Oh yeah, it's so good at that. Oh yeah, and I mean, I think what folks need to realize because, you know, everyone had that moment with chat GPT, but this was, it was like that, but more because GPT-4 is even better. Way better, yeah. And I said, can you say why the other answers aren't correct? Did it. Then I said, oh, you know, then I started like, I was almost shaking. Then I said, can you write 10 more questions like this? Bam, bam, bam. And you know, the first 10 I saw were all pretty good. Like I just, I'm like, oh yeah, yeah, yeah. That's all legit. And then, you know, the implications for Khan Academy started to go through my mind. And then we just started to get into some of its hallucinations and some of its math errors in those early days. But that weekend they gave me and our chief learning officer access on Slack. And we just, like I couldn't sleep. I was just having these in the rabbit hole conversations with it. And then we had a hackathon for our team. We got about 40 people on our team under NDA. And we said like, just come up with stuff. We were having the debates that everyone was having around, well, you know, the information's not 100% airtight, the math isn't great right now. The costs are not trivial. You know, can introduce bias. What's the safety? Can you, how could you use, you know, the use of people's information, et cetera. But then we were starting to get it to work well as something that just helps you answer questions while you're watching a video, to work well as a tutor. And then every, honestly, every 10 minutes we thought about it, we're like, wait, it could also do this. It could also do that. It can also do that. And so we said, well, what if we could make it so you could talk to any historical character? What if you can make it so it gets into a debate with you? What if you can make it so it doesn't write your paper, but it writes it with you? What if it could do lesson plans for teachers? It could be the end of static curricula. I mean, just the imagination kept going. And by December, January, we had our team in full rapid prototyping mode. And yeah, just, you know, recently we launched Conmigo and, you know, so far we're starting to titrate it out to the world, giving people access to it. But the feedback is very promising. What we're hearing overwhelmingly from social media and the press is that they're really happy that we've engaged in this and that we're taking a safe approach where parents and teachers can monitor it. We have a moderation filter. OpenAI has also gone through great pains to make sure that, you know, things stay appropriate. You know, you and I have talked extensively about the math issue and we've done some things that I think make it quite robust on top of the things that the model does. And the costs are coming down dramatically. I mean- Yeah, that's really impressive. Even chat GPT isn't bad. And then GPT-4 is dramatically better. I mean, it makes mistakes to be clear. They both make mistakes. But one of the things we realized is, but when you do math, especially if I'm tutoring you, let's say you do some work, I don't just immediately say correct, incorrect. I say, well, let me see this. Okay, let me see what he did. Okay, okay, okay. Okay, okay, yeah, yeah, good job. And one of the hacks, I don't think it's actually a hack. It's actually, I think a principle we're doing, which is we weren't getting good results when we just asked it to decide when it acts as a tutor, whether a student is right or wrong. But as soon as we said, you know what? Construct your thought. And these thoughts are private to you. Write that down first. And then evaluate the student's response to your thoughts. And then say something publicly to the student. Then the math improved dramatically. So it's, you know, it is funny. As soon as one day you think like, oh, this is so not like a human being. And so, and then the next year is like, wow, that's kind of how we operate. We kind of need that thought before we can talk. The way I think of it is it's like a human that's not very good with context. That the math context we know is a special context of check your answer. And it's also sometimes even in conversations, if you get it into a mode where it's telling jokes. With humans, we have kind of a look or the new question is quite different. It thinks it's supposed to just keep telling jokes. And you almost have to do a reset to get it out of this, hey, everything is a joke type mode. So it's like kind of a very naive person in terms of all these different contexts we're in. And my favorite one is where it tries to Sudoku, which it can't do. And you pointed out, hey, that's not a good solution. And it says, oh, I must have mistyped. Because it's like, where is the typewriter? Is it, you have a typewriter? I like it, it gets defensive. It gets defensive and learn that. Yeah, it sees how humans deal with being accused of getting my dog a homework or something like that. So yeah, it's kind of human, but in a naive untrained way. So if we think about the next 10 years, I'm sort of back to my optimism that I had when the Gates Foundation first got into education that both the absolute level of learning and the gap with lower income minority students that with these tools can both close the gap and raise up the overall level of achievement. After the pandemic, there's tens of billions of dollars came in from the federal government to address learning loss. Everyone looked at these decades old studies around high dosage tutoring and said, oh, we can kind of afford to do tutoring now. And so they hired a bunch of tutoring companies and this and that. And it's not the tutoring company's fault. But what you're seeing now is just another example that we often see in the school system. Like, wow, it was a good idea, but we're not really seeing it move the dial. And the retrospective people are saying, well, in order for it to really work, it's gotta be connected to what the kids are doing in school. And ideally it should be happening while they're doing it in school. And that's almost impossible logistically to do and expensive if you wanted to do it with live tutors. But Conmigo, the tutor that we're putting in Khan Academy, it in the moment can act like a fairly good human tutor. There's moments with it that I think would pass the Turing test where you think that there's a good human on the other side of the chat. And I think that has a good chance of driving engagement because not only can it tutor, you can ask it why you need to learn this. It's also, well, what do you care about? And you say, well, I care about this or that. I say, well, if you care about this, then this, you definitely need to learn this. And here's some other things to think about. And so it honestly answers it better than most humans would that that is going to just drive a whole nother level of engagement, a whole other level of, hey, a student is stuck in algebra because they have some gaps from seventh grade. That's very hard for one teacher with 30 kids to diagnose. But now to be able to intelligently with traditional tutoring interactions, say, hey, are you having trouble with the negative number here? Let's review that a little bit. I think that can drive a ton of engagement. I think honestly, just feeling more connected can drive engagement. I'm actually really excited about the next phase of Conmigo is going to be Conmigo facilitating interactions inside of a classroom. With group, with a group. With group. So imagine a teacher just says, hey, Conmigo, take my class of 30, put them into 10 groups of three. And I want every group to do this problem. And then I want the students to talk to each other about it, and you're the facilitator. We've run those types of experiments, and they're surprisingly fun where you can do that. And it's not just in math. You can do that in science. It pushes the students. So why do you think, how does entropy and chemistry connect to entropy and information theory, computer science, and all of these types of things, and the humanities? And I do think all of these are correlated, too. When students get confidence in one part of their academics, it drives all the other ones. But now a teacher can say, hey, Conmigo, ask all my students to give their reflection on this issue. And immediately, it can tell the teacher, hey, and this isn't science fiction. I think this is like six months away. It can say, hey, this is what everyone did. Here are some exemplars. Some of your kids tend to be confused here. This student seems a little bit disengaged. So I imagine, I mean, I think we're going to see it next year. While the teacher is lecturing or whatever they're doing, if you're confused by something they just said, you just ask the bot in real time. It's like whispering to your friend without disrupting the classroom. But then the teacher will know, hey, Conmigo will tell the teacher, hey, three kids just asked me this question. I answered it for you. They're good now. But hey, you might want to double click on that a little bit. We have another nonprofit called Schoolhouse.world, which is about peer-to-peer tutoring. And we're already using AI to evaluate the transcripts and give the tutors feedback on what they could do better. I could see it being a little bit of a real time, like, hey, you haven't called on this student. Or here's a worked example for you. So I think it's going to be a wild couple of years, but hopefully positive. And one thing I always underestimated is how valuable it is for most students to have kind of a social experience. How do you create a conceptually rich but socially engaging way of talking about these math things? No, 100%. Some of my best memories are sitting with friends and working on a particularly hard problem, and somebody has an epiphany. And so yeah, the more that we can try to replicate those things, the more that the model we use is it's a tutor for every student, and it could be a teaching assistant or an army of teaching assistants for every teacher. And I think every teacher on the planet would love to have one, two, three amazing teaching assistants in that classroom that say, hey, let's facilitate these breakouts. Let's do focused interventions with different students. Let's make them explain the math to each other. One challenge we've always had is that when we bring new technology into the classroom, if we don't do it well, the teacher feels like, oh, you're trying to denigrate my creativity or freedom, or you're suggesting I'm not capable on my own. And yet we all know teachers are heroic, one of the most important, hardest jobs in the world. So do you feel like we're doing better drawing both their input and showing that, OK, they are 100% at the center of the best solution? Yeah, and look, I think not only is this about making sure that everyone understands their critical role, but it's also that one of the reasons why you have such a high attrition in the profession, I mean, we could talk about pay and compensation, all of that. But I think the biggest thing is it can be a very lonely and a very tiring job. I mean, most of us would quote desk jobs. We don't have to be on continuously. But if you're a teacher. Nobody's trying to disrupt. No one's trying to disrupt or chewing gum or looking at you. And even when we're presenting, we're usually presenting to people who at least pretend to be interested, like you. They're told to be, yes. Exactly, they got the memo. While in a classroom, the kids aren't always giving you their most attentive look. And that is so draining energy-wise. And so we imagine the classroom of the future, and a lot of teachers are already doing this, is, yeah, make the students do most of the things most of the time and that the teacher is the architect, is the conductor of what's going on. And I don't think anyone in an orchestra would think that the conductor is not an important role. The conductor is making sure that the orchestra is happening together and that everything is fitting together, that it's controlled chaos. And then I think everyone benefits. The kids have more fun. They learn more, and then the teachers have more fun. Instead of one teacher with 30, you should have two teachers with 60 or three teachers with 90 so that they also feel less lonely, which you can start to do if you take the lecture out of the classroom. What do you think is going to happen in AI, in education, and work? Well, in the education piece, I actually think reading and writing, where the software tools have not been that great. Very few students get feedback on an essay that this could be clearer. You really skip this piece in the reasoning. And I do think the AI will be like a great high school teacher who really marks your essay. And you go back and think, OK, I need to step up there. The hardest question to answer is the job market. Now, we're not going to ever have too many teachers, because in the worst case, we shrink class sizes and get more attention. The demand is pretty infinite there. And I do a lot of my work in countries where the shortage of doctors and teachers is so acute that the idea of, OK, the AI is too good. We don't really run into that. But the job market, I think that one, it's very hard to predict how it'll shift things. I don't think students should feel like, OK, I need to learn less. I don't need to multiply because computers were so good at multiplication. The new areas of job demand and how we shape this is going to be fascinating to see. If you were to advise a parent or a student who's, let's say, a teenager is figuring out what to do with their life, given everything we talked about, AI, job market, what would you tell them? It's great if you learn enough that you find something that's particularly fascinating to you. I have an orientation towards the sciences. I still think helping these AI things be better, we need that. The climate work we need is very, very scientifically intense. So anything in medicine, whether I have one child who wants to do political policy, including health care, I have one who's going to be a doctor, I have one who wants to be the CEO of the hospital. So all of them can contribute in very different ways. And what they pick matches the differences in what they enjoy, what they're really good at. I would love it if some really smart people would go into politics. I know that's not attractive, but I think we need a new generation of science literate and reaching across the divide we have. God knows young people better come in and help us out there. So Bill, what teachers really pop out in your mind that really affected you? Well, early on in math, I was kind of lazy. And a teacher in eighth grade said, how come you're so lazy? You could be really good at this. And I said, but we're not doing anything interesting. He would give me books to read and help really push me quite a bit. It made a huge difference that he sort of thought I was wasting my time. It changed my whole view of education. I kind of had this view that less effort you put in, the cooler you were. That's right. Very good. Do you have a particular teacher that helped motivate you? I have several, probably three or four that pop in my mind. There's a second grade, Miss Krauss and Miss Roussel. It was kind of this enrichment gifted program. They were the first teachers that really said, hey, what are you interested in? And that was the first time I experienced personalized education. Jefferson Paris School System in Louisiana, I've got to give credit. It was a really great experience. Then I remember Miss Ellis in fifth grade. She ran her fifth grade social studies class, like what I now know is a college seminar. She would just peel an orange and just ask us questions. And I used to look forward to it. And then I also, Dr. Hirosh Santa-Nia, when I was in high school, I took courses at the University of New Orleans, which was a local college there. And he was my differential equations teacher. And when he found out that I didn't have a computer at home, he's like, well, you need a computer. And so he got me a research job at the University of New Orleans when I was 15 years old. And that's the first time I really got to work with real computers. And if I didn't have that experience, I don't know what would have happened after that. If you had one magic wish to master a subject without any studying, which would you choose? I would say it would either be quantum physics or piano. That's it. I'm embarrassed that even though I know all these computer languages, and I took Latin and Greek, I don't speak any real languages other than English. So maybe if it was easy to learn and I could just use my wish on it, I might choose Chinese. Because I do think helping China and the US get along is going to be pretty important. So I said before you came, if you had a record that you wanted to bring, please share it with me. Yeah, so what we're going to play is Bob Marley's Redemption Song, which is, you mentioned my high school rock star days. Redemption Song was one of the first songs that I learned on guitar. It always spoke to me. It's about bondage of many kinds, both physical and mental bondage, and kind of breaking free of it. Yeah, so I'll play it. Cool. [\"RBJSKRUG\"] Old pirates, yesterday robbers, sold out to the merchant ships. So great. Minutes after day took I. This is just a classic. From the bottom this bit. But my hand was made strong. So if you do a web search on Saul Khan, you might get some of this guy. So do you ever get confused with Salman Khan? I do. In fact, the early days of Khan Academy, I got letters from some of his fans saying, I've always been in love with you, and now I didn't know you can do math and all that. And it's funny because us South Asians like a good kind of cheesy thing. So when I went to India in 2050, actually I saw you there. We had a live on national television interview between the two of us. Oh, you're kidding. Just by virtue of us having the same name. But I do watch more Bollywood movies than folks suspect. My wife grew up in Pakistan, so people think that she made me watch the Bollywood movies, but it's usually the other way around. I'm the one that made her watch the Bollywood. So I was very aware of him, so it was kind of a fun thing to be in the same room and share the same name. Do you watch them in Hindi or English? I can understand Hindi, which I have no business understanding. My family, our mother tongue is Bengali. Oh, Bengali? Oh, wow. And your wife? My wife's mother tongue, they're originally Gujarati, but she spoke Urdu growing up in Pakistan. But I learned Hindi mainly hearing my mom gossip on the phone when I was growing up. And then Bollywood movies, that's my Hindi. And now a little bit Hindi and Urdu spoken is almost the same thing. So I know enough to get by. You and I both want education to be a lot better, and really for all types of students. It's an exciting time, and it seems like you've got as much energy for Khan Academy today as you did when it first got started. Yeah, I've always run optimistic, and I've always had a reasonable amount of energy. But yeah, I've told the team, what's about to happen in the next few years, it feels like we're in the middle of a science fiction book, and hopefully it'll be all for good. And I'm pretty hopeful. Well, thanks for coming down. Thanks for being on a learning journey with me in a cause that we both believe in. Thank you. Hopefully I've unconfused you. Yeah, yeah, definitely. A little bit. Unconfuse Me is a production of the Gates Notes. Special thanks to my guest today, Saul Khan. No, I've never been mistaken for a Salman Khan. Yeah."
  },
  "podcast_guest": {
    "guest_name": "Sol Khan"
  },
  "podcast_highlights": "In this podcast episode, Bill Gates interviews Sol Khan, the CEO of Khan Academy. They discuss the role of technology in education and the potential it has for improving learning outcomes. Sol Khan shares his journey of starting Khan Academy and how it grew to have 140 million users. They also talk about the impact of AI on education, including the development of Conmigo, a tutoring AI system. Sol Khan explains how Conmigo can act as a tutor for students and a teaching assistant for teachers, providing personalized education and real-time feedback. They discuss the importance of engaging students and the potential for AI to enhance social interactions in the classroom. They also touch on the future of AI in education and the job market. The podcast ends with Sol Khan playing Bob Marley's \"Redemption Song.\" Throughout the conversation, Sol Khan reflects on the teachers who had a significant impact on his own education and the importance of personalized learning.",
  "podcast_summary": "Title: Bill Gates interviews Sal Khan, CEO of Khan Academy\n\n- The transcript is a podcast interview where Bill Gates interviews Sal Khan, CEO of Khan Academy.\n- Sal Khan shares his background and how he started tutoring his cousin, which eventually led to the creation of Khan Academy.\n- They discuss the role of technology in education and Khan Academy's impact on learning.\n- Sal Khan talks about the benefits of personalized learning and how Khan Academy's tools can be used in the classroom.\n- They discuss the potential of AI in education and how it can facilitate learning and engagement.\n- Sal Khan introduces Conmigo, a tutor tool powered by AI, and its potential applications in tutoring, essay feedback, and classroom facilitation.\n- They share their experiences with AI, including its capabilities and limitations.\n- Bill Gates and Sal Khan share their thoughts on the future of education and the job market.\n- They reflect on the importance of teachers and their role in education.\n- Bill Gates asks Sal Khan about influential teachers in his life.\n- The interview ends with a discussion about Bollywood movies and their shared name, Khan.\n\nNote: The interview covers a wide range of topics, but the main focus revolves around the impact of technology, personalized learning, and the potential of AI in education."
}